Documents/Талоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Талоны</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КоличествоЛьготВыдано</xr:Item>
				<xr:Item>InformationRegister.ТалоныНаЛьготы</xr:Item>
				<xr:Item>AccumulationRegister.КоличествоЛьготПоКатегориям</xr:Item>
				<xr:Item>InformationRegister.НумирацияТалонов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДолжностьДляРосписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникДляРосписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СельскийСовет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СельскиеСоветы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьгот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВедомости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТалоныТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДомовладельца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПолучателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаОтпуска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПолучателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДействияТалона</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СельскийСовет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СельскиеСоветы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтпускаУгля</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛичноеДело</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачиЗаявителю</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕденицыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕденицыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомплектностьДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подстановка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформацияПоВыдаче</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачиЗаявителю</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Талоны/Ext/ManagerModule.bsl
#Область ПрограмныйИтерфейс
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();	
	КомандаПечати.МенеджерПечати = "Документ.Талоны";
	КомандаПечати.Идентификатор = "Талоны";
	КомандаПечати.МестоРазмещения = "ПодменюПечать";
	КомандаПечати.Представление = НСтр("ru = 'Талоны на уголь'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати5 = КомандыПечати.Добавить();	
	КомандаПечати5.МенеджерПечати = "Документ.Талоны";
	КомандаПечати5.Идентификатор = "ТалоныГоризонталь";
	КомандаПечати5.МестоРазмещения = "ПодменюПечать";
	КомандаПечати5.Представление = НСтр("ru = 'Талоны на уголь горизонталь'");
	КомандаПечати5.ПроверкаПроведенияПередПечатью = Ложь;

	
	КомандаПечати2 = КомандыПечати.Добавить();	
	КомандаПечати2.МенеджерПечати = "Документ.Талоны";
	КомандаПечати2.Идентификатор = "ТалоныРегистрация";
	КомандаПечати2.МестоРазмещения = "ПодменюПечать";
	КомандаПечати2.Представление = НСтр("ru = 'Регистрация талонов'");
	КомандаПечати2.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати3 = КомандыПечати.Добавить();	
	КомандаПечати3.МенеджерПечати = "Документ.Талоны";
	КомандаПечати3.Идентификатор = "ТалоныСельскимСоветам";
	КомандаПечати3.МестоРазмещения = "ПодменюПечать";
	КомандаПечати3.Представление = НСтр("ru = 'Реестр сельским советам'");
	КомандаПечати3.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати4 = КомандыПечати.Добавить();	
	КомандаПечати4.МенеджерПечати = "Документ.Талоны";
	КомандаПечати4.Идентификатор = "ТалоныСельскимСоветамИНомераЗаявлений";
	КомандаПечати4.МестоРазмещения = "ПодменюПечать";
	КомандаПечати4.Представление = НСтр("ru = 'Реестр сельским советам с номерами заявлений'");
	КомандаПечати4.ПроверкаПроведенияПередПечатью = Ложь;

КонецПроцедуры
Процедура Печать(МассивОбъектов,ПараметрыПечати,КоллекцияПечатныхФорм,ОбъектыПечати,ПараметрыВывода) Экспорт
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"Талоны");
	ПечатнаяФорма5 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"ТалоныГоризонталь");

	ПечатнаяФорма2 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"ТалоныРегистрация");
	ПечатнаяФорма3 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"ТалоныСельскимСоветам");
	ПечатнаяФорма4 = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм,"ТалоныСельскимСоветамИНомераЗаявлений");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьТалоны(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Талоны на уголь'");
        ПечатнаяФорма.ПолныйПутьКМакету = "Документ.Талоны.ПФ_MXL_МакетТалоны";
	КонецЕсли;	
	
	Если ПечатнаяФорма2 <> Неопределено Тогда
		ПечатнаяФорма2.ТабличныйДокумент = ПечатьТалоныРегистрация(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма2.СинонимМакета = НСтр("ru = 'Регистрация талонов на уголь'");
        ПечатнаяФорма2.ПолныйПутьКМакету = "Документ.Талоны.Печать";
	КонецЕсли;
	
	Если ПечатнаяФорма3 <> Неопределено Тогда
		ПечатнаяФорма3.ТабличныйДокумент = ПечатьРеестраС_С(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма3.СинонимМакета = НСтр("ru = 'Реестр сельским совеам'");
        ПечатнаяФорма3.ПолныйПутьКМакету = "Документ.Талоны.ПФ_MXL_РеестрТалоны";
	КонецЕсли;
	
	Если ПечатнаяФорма4 <> Неопределено Тогда       
		ПечатнаяФорма4.ТабличныйДокумент = ПечатьРеестраС_С_НомераЗаявлений(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма4.СинонимМакета = НСтр("ru = 'Реестр по сельским совеам с номером заявления'");
        ПечатнаяФорма4.ПолныйПутьКМакету = "Документ.Талоны.ПФ_MXL_РеестрТалоныИНомераЗаявлений";
	КонецЕсли;
	Если ПечатнаяФорма5 <> Неопределено Тогда
		ПечатнаяФорма5.ТабличныйДокумент = ПечатьТалоныГоризонталь(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма5.СинонимМакета = НСтр("ru = 'Талоны на уголь горизонталь'");
        ПечатнаяФорма5.ПолныйПутьКМакету = "Документ.Талоны.ПФ_MXL_МакетТалоныГоризонталь";
	КонецЕсли;	


КонецПроцедуры	
#КонецОбласти


Функция ПечатьТалоныРегистрация(МассивОбъектов,ОбъектыПечати) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПараметрыПечати_ТалоныРегистрация";
	Макет = Документы.Талоны.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ТалоныТалоныТЧ.Ссылка.Организация КАК Организация,
	 |	ТалоныТалоныТЧ.НомерСтроки КАК НомерСтроки,
	 |	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
	 |	ТалоныТалоныТЧ.Номер КАК Номер,
	 |	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачи,
	 |	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца
	 |ИЗ
	 |	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
	 |ГДЕ
	 |	ТалоныТалоныТЧ.Ссылка В(&МассивОбъектов)";

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТалоныТЧШапка = Макет.ПолучитьОбласть("ТалоныТЧШапка");
	ОбластьТалоныТЧ = Макет.ПолучитьОбласть("ТалоныТЧ");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	ТабДок.Вывести(ОбластьЗаголовок);
	//Шапка.Параметры.Заполнить(Выборка);
	Шапка.Параметры.Организация = МассивОбъектов[0].Организация;
	ТабДок.Вывести(Шапка);
	ТабДок.Вывести(ОбластьТалоныТЧШапка);
	Пока Выборка.Следующий() Цикл
		//Если ВставлятьРазделительСтраниц Тогда
		//	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЕсли;
		
		Строка = Макет.ПолучитьОбласть("ТалоныТЧ");
		Строка.Параметры.НомерСтроки = Выборка.НомерСтроки;
		Строка.Параметры.Заявитель = Выборка.Заявитель;
		Строка.Параметры.Номер = Выборка.Номер;
		Строка.Параметры.АдресДомовладельца = Выборка.АдресДомовладельца;
		Строка.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy");

		ТабДок.Вывести(Строка);
		

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	Возврат ТабДок;
КонецФункции	

Функция ПечатьТалоныГоризонталь(МассивОбъектов,ОбъектыПечати)
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ТалныГоризонталь";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Талоны.ПФ_MXL_МакетТалоныГоризонталь");
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.Талоны КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    
    ПервыйДокумент = Истина;
    
    Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		КолТалоновНаЛисте = 1;
		КолНаЛисте = 1;
		//Начало вывода документа
		Для Каждого СтрокаТЧ Из  Выборка.Ссылка.ТалоныТЧ  Цикл
			Если КолНаЛисте = 7 Тогда 
				 КолНаЛисте =1;
				 ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			Область = Макет.ПолучитьОбласть("Талон|Горизонталь");
			Область.Параметры.Заявитель = СтрокаТЧ.Заявитель;
		    Область.Параметры.Номер   =  СтрокаТЧ.Номер;
			Область.Параметры.АдресДомовладельца  = СтрокаТЧ.АдресДомовладельца;                        
			Область.Параметры.СтатусПолучателя = СтрокаТЧ.Категория;
		    Область.Параметры.НомерПолучателя  = СтрокаТЧ.НомерПолучателя;
			Область.Параметры.ПредметЛьготы   = СтрокаТЧ.ПредметЛьготы;
			Область.Параметры.НормаОтпуска  = СтрокаТЧ.НормаОтпуска;
			Область.Параметры.ЕденицаИзмерения  = СтрокаТЧ.ЕденицыИзмерения;
			Область.Параметры.ДатаВыдачи    =Формат(СтрокаТЧ.ДатаВыдачи,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			Область.Параметры.ПериодДействияТалона  = Формат(СтрокаТЧ.ПериодДействияТалона,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			Область.Параметры.ДатаОтпускаУгля  = Формат(СтрокаТЧ.ДатаОтпускаУгля,"ДФ=dd.MM.yyyy; ДЛФ=DD");
		    Область.Параметры.ЗаявительИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрокаТЧ.Заявитель);
			ТекущийНачальник = ПараметрыСеанса.ТекущийНачальникУправления;
		    Область.Параметры.СотрудникДляРосписиИнициалы  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ТекущийНачальник); 
			Область.Параметры.ДолжностьДляРосписи  =  ТекущийНачальник.Должность;
			Область.Параметры.Организация   =  Выборка.Ссылка.Организация.ПолноеНаименование;
			Если КолТалоновНаЛисте > 3 Тогда
				ТабличныйДокумент.ВывестиВертикальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(Область);
				КолТалоновНаЛисте = 1;
				
			Иначе
				ТабличныйДокумент.Присоединить(Область);
			КонецЕсли;	
			КолТалоновНаЛисте = КолТалоновНаЛисте +1;
			КолНаЛисте = КолНаЛисте+1;	
		КонецЦикла;
		//Конец вывода документа
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабличныйДокумент.АвтоМасштаб=Истина;
		
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;
	

КонецФункции	


Функция ПечатьТалоны(МассивОбъектов,ОбъектыПечати)
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Талны";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Талоны.ПФ_MXL_МакетТалоны");
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТаблицаДокумента.Ссылка КАК Ссылка
    |ИЗ
    |	Документ.Талоны КАК ТаблицаДокумента
    |ГДЕ
    |	ТаблицаДокумента.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    Выборка = Запрос.Выполнить().Выбрать();
    
    ПервыйДокумент = Истина;
    
    Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		//Начало вывода документа
		Для Каждого СтрокаТЧ Из  Выборка.Ссылка.ТалоныТЧ  Цикл

			Область = Макет.ПолучитьОбласть("Талон");
			Область.Параметры.Заявитель = СтрокаТЧ.Заявитель;
		    Область.Параметры.Номер   =  СтрокаТЧ.Номер;
			Область.Параметры.АдресДомовладельца  = СтрокаТЧ.АдресДомовладельца;                        
			Область.Параметры.СтатусПолучателя = СтрокаТЧ.Категория;
		    Область.Параметры.НомерПолучателя  = СтрокаТЧ.НомерПолучателя;
			Область.Параметры.НормаОтпуска  = СтрокаТЧ.НормаОтпуска;
			Область.Параметры.ЕденицаИзмерения  = СтрокаТЧ.ЕденицыИзмерения;
			Область.Параметры.ДатаВыдачи    =Формат(СтрокаТЧ.ДатаВыдачи,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			Область.Параметры.ПериодДействияТалона  = Формат(СтрокаТЧ.ПериодДействияТалона,"ДФ=dd.MM.yyyy; ДЛФ=DD");
			Область.Параметры.ДатаОтпускаУгля  = Формат(СтрокаТЧ.ДатаОтпускаУгля,"ДФ=dd.MM.yyyy; ДЛФ=DD");
		    Область.Параметры.ЗаявительИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтрокаТЧ.Заявитель);
		    Область.Параметры.СотрудникДляРосписиИнициалы  = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Выборка.Ссылка.Организация.Начальник); 
			Область.Параметры.Организация   =  Выборка.Ссылка.Организация.ПолноеНаименование;
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;
		//Конец вывода документа
		
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;
	

КонецФункции	

Функция ПечатьРеестраС_С(МассивОбъектов,ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ТалныСС";
	
	Макет = Документы.Талоны.ПолучитьМакет("ПФ_MXL_РеестрТалоны");

			
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(МассивОбъектов[0].СельскийСовет) Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.НомерСтроки КАК НомерСтроки,
		|	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
		|	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца,
		|	ТалоныТалоныТЧ.Номер КАК Номер,
		|	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачи,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.Заявитель.ДатаРождения КАК ЗаявительДатаРождения,
		|	ТалоныТалоныТЧ.Заявитель.ПаспортСерия + ТалоныТалоныТЧ.Заявитель.ПаспортНомер КАК ПаспортныеДанные,
		|	ТалоныТалоныТЧ.Заявитель.ИНН КАК ЗаявительИНН,
		|	"""" КАК ДатаПолучения,
		|	"""" КАК ПодписьЗаявителя
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.Ссылка В(&МассивОбъектов)
		|	И ТалоныТалоныТЧ.СельскийСовет = &СельскийСовет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Категория";
	
		Запрос.УстановитьПараметр("СельскийСовет", МассивОбъектов[0].СельскийСовет);	
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.НомерСтроки КАК НомерСтроки,
		|	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
		|	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца,
		|	ТалоныТалоныТЧ.Номер КАК Номер,
		|	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачи,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.Заявитель.ДатаРождения КАК ЗаявительДатаРождения,
		|	ТалоныТалоныТЧ.Заявитель.ПаспортСерия + ТалоныТалоныТЧ.Заявитель.ПаспортНомер КАК ПаспортныеДанные,
		|	ТалоныТалоныТЧ.Заявитель.ИНН КАК ЗаявительИНН,
		|	"""" КАК ДатаПолучения,
		|	"""" КАК ПодписьЗаявителя
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Категория";

	КонецЕсли;	
	 Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(Шапка);
	Счетчик = 1;
	Пока Выборка.Следующий() Цикл
		Строка = Макет.ПолучитьОбласть("Строка");
		Строка.Параметры.НомерСтроки = Счетчик;
		Строка.Параметры.Заявитель = Выборка.Заявитель;
		Строка.Параметры.Номер = Выборка.Номер;
		Строка.Параметры.АдресДомовладельца = Выборка.АдресДомовладельца;
		Строка.Параметры.Категория = Выборка.Категория;
		Строка.Параметры.ДатаРождения = Формат(Выборка.ЗаявительДатаРождения,"ДФ=dd.MM.yyyy");
		Строка.Параметры.ПаспортныеДанные = Выборка.ПаспортныеДанные;
		Строка.Параметры.ИНН = Выборка.ЗаявительИНН;
		Строка.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy");

		ТабличныйДокумент.Вывести(Строка);
		Счетчик = Счетчик+1;
		
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		//    НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);

	КонецЦикла;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");	
	Подвал.Параметры.КоличествоТалонов = Счетчик-1;
	ТабличныйДокумент.Вывести(Подвал);


	Возврат ТабличныйДокумент;
	

КонецФункции // ПечатьРеестраС_С()
 
Функция ПечатьРеестраС_С_НомераЗаявлений(МассивОбъектов,ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ТалныСС_НомерЗаявления";
	
	Макет = Документы.Талоны.ПолучитьМакет("ПФ_MXL_РеестрТалоныИНомераЗаявлений");

			
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(МассивОбъектов[0].СельскийСовет) Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.НомерСтроки КАК НомерСтроки,
		|	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
		|	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца,
		|	ТалоныТалоныТЧ.Номер КАК Номер,
		|	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачи,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.Заявитель.ДатаРождения КАК ЗаявительДатаРождения,
		|	ТалоныТалоныТЧ.Заявитель.ПаспортСерия + ТалоныТалоныТЧ.Заявитель.ПаспортНомер КАК ПаспортныеДанные,
		|	ТалоныТалоныТЧ.Заявитель.ИНН КАК ЗаявительИНН,
		|	ТалоныТалоныТЧ.ДокументОснование.НомерЗаявления КАК НомерЗаявления,
		|	ТалоныТалоныТЧ.ДокументОснование.ДатаЗаявления КАК ДатаЗаявления,
		|	ТалоныТалоныТЧ.ДатаОтпускаУгля КАК ДатаОтпускаУгля,
		|	ТалоныТалоныТЧ.ПредметЛьготы КАК ПредметЛьготы,
		|   ТалоныТалоныТЧ.ДатаВыдачиЗаявителю КАК ДатаВыдачиЗаявителю
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.Ссылка В(&МассивОбъектов)
		|	И ТалоныТалоныТЧ.СельскийСовет = &СельскийСовет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
		Запрос.УстановитьПараметр("СельскийСовет", МассивОбъектов[0].СельскийСовет);	
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.НомерСтроки КАК НомерСтроки,
		|	ТалоныТалоныТЧ.Заявитель КАК Заявитель,
		|	ТалоныТалоныТЧ.АдресДомовладельца КАК АдресДомовладельца,
		|	ТалоныТалоныТЧ.Номер КАК Номер,
		|	ТалоныТалоныТЧ.ДатаВыдачи КАК ДатаВыдачи,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.Заявитель.ДатаРождения КАК ЗаявительДатаРождения,
		|	ТалоныТалоныТЧ.Заявитель.ПаспортСерия + ТалоныТалоныТЧ.Заявитель.ПаспортНомер КАК ПаспортныеДанные,
		|	ТалоныТалоныТЧ.Заявитель.ИНН КАК ЗаявительИНН,
		|	ТалоныТалоныТЧ.ДокументОснование.НомерЗаявления КАК НомерЗаявления,
		|	ТалоныТалоныТЧ.ДокументОснование.ДатаЗаявления КАК ДатаЗаявления,
		|	ТалоныТалоныТЧ.ДатаОтпускаУгля КАК ДатаОтпускаУгля,
		|	ТалоныТалоныТЧ.ПредметЛьготы КАК ПредметЛьготы,
		|	ТалоныТалоныТЧ.ДатаВыдачиЗаявителю КАК ДатаВыдачиЗаявителю
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";

	КонецЕсли;	
	 Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(Шапка);
	Счетчик = 1;
	Пока Выборка.Следующий() Цикл
		Строка = Макет.ПолучитьОбласть("Строка");
		Строка.Параметры.НомерСтроки = Счетчик;
		Строка.Параметры.Заявитель = Выборка.Заявитель;
		Строка.Параметры.Номер = Выборка.Номер;
		Строка.Параметры.АдресДомовладельца = Выборка.АдресДомовладельца;
		Строка.Параметры.Категория = Выборка.Категория;
		Строка.Параметры.ДатаРождения = Формат(Выборка.ЗаявительДатаРождения,"ДФ=dd.MM.yyyy");
		Строка.Параметры.ПаспортныеДанные = Выборка.ПаспортныеДанные;
		Строка.Параметры.ИНН = Выборка.ЗаявительИНН;
		Строка.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи,"ДФ=dd.MM.yyyy");
		Строка.Параметры.НомерЗаявления = Выборка.НомерЗаявления;
		Строка.Параметры.ДатаЗаявления = Формат(Выборка.ДатаЗаявления,"ДФ=dd.MM.yyyy");
		Строка.Параметры.ВидТТ = Выборка.ПредметЛьготы;
		Строка.Параметры.ДатаВыдачиЗаявителю = Формат(Выборка.ДатаВыдачиЗаявителю,"ДФ=dd.MM.yyyy");
		Строка.Параметры.ДатаПолученияТТ =  Формат(Выборка.ДатаОтпускаУгля,"ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(Строка);
		Счетчик = Счетчик+1;
		
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		//    НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);

	КонецЦикла;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");	
	Подвал.Параметры.КоличествоТалонов = Счетчик-1;
	ТабличныйДокумент.Вывести(Подвал);


	Возврат ТабличныйДокумент;
	

КонецФункции
